Dynamic Analysis/Command Injection/Training/workload_scripts/wrk2/1.txt
Running 2m test @ http://10.10.1.143:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.35s     1.09s    4.21s    58.05%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.34s 
 75.000%    3.29s 
 90.000%    3.82s 
 99.000%    4.21s 
 99.900%    4.31s 
 99.990%    4.33s 
 99.999%    4.33s 
100.000%    4.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     403.967     0.000000            1         1.00
     828.927     0.100000          361         1.11
    1235.967     0.200000          721         1.25
    1604.607     0.300000         1082         1.43
    1977.343     0.400000         1442         1.67
    2344.959     0.500000         1802         2.00
    2531.327     0.550000         1985         2.22
    2719.743     0.600000         2163         2.50
    2926.591     0.650000         2343         2.86
    3106.815     0.700000         2523         3.33
    3291.135     0.750000         2703         4.00
    3391.487     0.775000         2794         4.44
    3491.839     0.800000         2884         5.00
    3579.903     0.825000         2976         5.71
    3661.823     0.850000         3064         6.67
    3745.791     0.875000         3155         8.00
    3780.607     0.887500         3200         8.89
    3823.615     0.900000         3244        10.00
    3868.671     0.912500         3291        11.43
    3923.967     0.925000         3337        13.33
    3971.071     0.937500         3381        16.00
    3991.551     0.943750         3403        17.78
    4018.175     0.950000         3424        20.00
    4042.751     0.956250         3450        22.86
    4065.279     0.962500         3470        26.67
    4093.951     0.968750         3492        32.00
    4104.191     0.971875         3504        35.56
    4116.479     0.975000         3515        40.00
    4132.863     0.978125         3526        45.71
    4147.199     0.981250         3540        53.33
    4165.631     0.984375         3549        64.00
    4171.775     0.985938         3556        71.11
    4179.967     0.987500         3559        80.00
    4194.303     0.989062         3566        91.43
    4210.687     0.990625         3572       106.67
    4222.975     0.992188         3576       128.00
    4235.263     0.992969         3581       142.22
    4243.455     0.993750         3582       160.00
    4251.647     0.994531         3585       182.86
    4259.839     0.995313         3588       213.33
    4263.935     0.996094         3590       256.00
    4272.127     0.996484         3592       284.44
    4276.223     0.996875         3594       320.00
    4280.319     0.997266         3595       365.71
    4292.607     0.997656         3596       426.67
    4296.703     0.998047         3597       512.00
    4308.991     0.998242         3599       568.89
    4308.991     0.998437         3599       640.00
    4313.087     0.998633         3600       731.43
    4313.087     0.998828         3600       853.33
    4325.375     0.999023         3602      1024.00
    4325.375     0.999121         3602      1137.78
    4325.375     0.999219         3602      1280.00
    4325.375     0.999316         3602      1462.86
    4325.375     0.999414         3602      1706.67
    4329.471     0.999512         3603      2048.00
    4329.471     0.999561         3603      2275.56
    4329.471     0.999609         3603      2560.00
    4329.471     0.999658         3603      2925.71
    4329.471     0.999707         3603      3413.33
    4333.567     0.999756         3604      4096.00
    4333.567     1.000000         3604          inf
#[Mean    =     2345.269, StdDeviation   =     1087.633]
#[Max     =     4329.472, Total count    =         3604]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3604 requests in 6.01s, 653.51KB read
  Non-2xx or 3xx responses: 35
Requests/sec:    600.10
Transfer/sec:    108.82KB